<img src="https://images.efollett.com/htmlroot/images/templates/storeLogos/CA/864.gif" style="float: right;"> 




# ECON628-01 
### Lecture -  1.1 Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np

In [3]:
# read in stata file and create a pandas dataframe
df = pd.read_stata('C:/Users/Dino Carlo/Desktop/ECON628-01/datasets/world_bank/wine.dta')

In [6]:
df.shape

(21, 5)

In [7]:
# head of dataset

df.head(0)

Empty DataFrame
Columns: [country, alcohol, deaths, heart, liver]
Index: []

In [10]:
df.describe()

         alcohol       deaths       heart      liver
count  21.000000    21.000000   21.000000  21.000000
mean    2.838095   830.047619  183.285714  21.033335
std     2.458145    96.518639   73.158829  11.958693
min     0.600000   680.000000   36.000000   6.500000
25%     1.200000   751.000000  131.000000  11.200000
50%     1.900000   806.000000  191.000000  19.000000
75%     2.900000   916.000000  220.000000  23.900000
max     9.100000  1000.000000  300.000000  45.599998

In [4]:
# tail of dataset

df.tail()

         country  alcohol  deaths  heart      liver
16        Sweden      1.6     743    207  11.200000
17   Switzerland      5.8     693    115  20.299999
18            UK      1.3     941    285  10.300000
19            US      1.2     926    199  22.100000
20  West Germany      2.7     861    172  36.700001

In [11]:
df['country'].describe()

count        21
unique       21
top       Spain
freq          1
Name: country, dtype: object

In [13]:
# summary stats

df[0:2]

     country  alcohol  deaths  heart      liver
0  Australia      2.5     785    211  15.300000
1    Austria      3.9     863    167  45.599998

In [6]:
# select a single column

df['country']

0        Australia
1          Austria
2         Belg/Lux
3           Canada
4          Denmark
5          Finland
6           France
7          Iceland
8          Ireland
9           Israel
10           Italy
11           Japan
12     Netherlands
13     New Zealand
14          Norway
15           Spain
16          Sweden
17     Switzerland
18              UK
19              US
20    West Germany
Name: country, dtype: object

In [7]:
# slice certain rows 

df[0:3]

     country  alcohol  deaths  heart      liver
0  Australia      2.5     785    211  15.300000
1    Austria      3.9     863    167  45.599998
2   Belg/Lux      2.9     883    131  20.700001

In [8]:
# slice for rows 9-14

df[9:15]

        country  alcohol  deaths  heart      liver
9        Israel      0.6     834    183  13.700000
10        Italy      7.9     775    107  42.200001
11        Japan      1.5     680     36  23.200001
12  Netherlands      1.8     773    167   9.200000
13  New Zealand      1.9     916    266   7.700000
14       Norway      0.8     806    227  12.200000

In [14]:
# slice some rows

df.iloc[1:3, :]

    country  alcohol  deaths  heart      liver
1   Austria      3.9     863    167  45.599998
2  Belg/Lux      2.9     883    131  20.700001

In [10]:
# slice some columns

df.iloc[:,1:3]

    alcohol  deaths
0       2.5     785
1       3.9     863
2       2.9     883
3       2.4     793
4       2.9     971
5       0.8     970
6       9.1     751
7       0.8     743
8       0.7    1000
9       0.6     834
10      7.9     775
11      1.5     680
12      1.8     773
13      1.9     916
14      0.8     806
15      6.5     724
16      1.6     743
17      5.8     693
18      1.3     941
19      1.2     926
20      2.7     861

In [16]:
# slice for the 'deaths' column

df.iloc[:,3:5]

    heart      liver
0     211  15.300000
1     167  45.599998
2     131  20.700001
3     191  16.400000
4     220  23.900000
5     297  19.000000
6      71  37.900002
7     211  11.200000
8     300   6.500000
9     183  13.700000
10    107  42.200001
11     36  23.200001
12    167   9.200000
13    266   7.700000
14    227  12.200000
15     86  36.400002
16    207  11.200000
17    115  20.299999
18    285  10.300000
19    199  22.100000
20    172  36.700001

In [18]:
# select for an explicit value only
df.iloc[1:4,3:5]

   heart      liver
1    167  45.599998
2    131  20.700001
3    191  16.400000